Autodesk.Navisworks.Api.DataPropertyNames
Names (values of Autodesk.Navisworks.Api.DataProperty.Name) of commonly found properties.

Autodesk.Navisworks.Api.DataPropertyNames.AutoCadEntityHandleValue
Name of AutoCad Entity Handle (Autodesk.Navisworks.Api.PropertyCategoryNames.AutoCadEntityHandle)
"Value" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemCreator
Name of Item "Creator" property (same as Autodesk.Navisworks.Api.Model.Creator)

Autodesk.Navisworks.Api.DataPropertyNames.ItemFileName
Name of Item "File Name" property (same as Autodesk.Navisworks.Api.Model.FileName)

Autodesk.Navisworks.Api.DataPropertyNames.ItemGuid
Name of Item "GUID" property (same as Autodesk.Navisworks.Api.ModelItem.InstanceGuid)

Autodesk.Navisworks.Api.DataPropertyNames.ItemHidden
Name of Item "Hidden" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemIcon
Name of Item "Icon" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemInternalType
Name of Item "Internal Type" property (same as Autodesk.Navisworks.Api.ModelItem.ClassName)

Autodesk.Navisworks.Api.DataPropertyNames.ItemLayer
Name of Item "Layer" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemMaterial
Name of Item "Material" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemName
Name of Item "Name" property (same as Autodesk.Navisworks.Api.ModelItem.DisplayName)

Autodesk.Navisworks.Api.DataPropertyNames.ItemRequired
Name of Item "Required" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemSourceFile
Name of Item "Source File" property

Autodesk.Navisworks.Api.DataPropertyNames.ItemSourceFileName
Name of Item "Source File Name" property (same as Autodesk.Navisworks.Api.Model.SourceFileName)

Autodesk.Navisworks.Api.DataPropertyNames.ItemType
Name of Item "Type" property (same as Autodesk.Navisworks.Api.ModelItem.ClassDisplayName)

Autodesk.Navisworks.Api.DataPropertyNames.ItemUnit
Name of Item "Unit" property (same as Autodesk.Navisworks.Api.Model.Units)

Autodesk.Navisworks.Api.DataPropertyNames.MicrostationElementIdValue
Name of Microstation Element Id (Autodesk.Navisworks.Api.PropertyCategoryNames.MicrostationElementId)
"Value" property

Autodesk.Navisworks.Api.DataPropertyNames.RevitElementIdValue
Name of Revit Element Id (Autodesk.Navisworks.Api.PropertyCategoryNames.RevitElementId)
"Value" property